# Codecademy Subscriber Pipeline Portfolio Project

For this project, we will build a data engineering pipeline to regularly transform a messy database into a clean source for an analytics team.

## Scenario

We will be working with a mock database of long-term cancelled subscribers for a fictional subscription company. This database is regularly updated from multiple sources, and needs to be routinely cleaned and transformed into usable shape with as little human intervention as possible.

## About the Data

It’s important to practice working with customer data, especially as a data engineer. But it would be unethical to share actual customer data, so we are using a realistic but entirely fictional dataset. Our version of the dataset is based around a fictional education company called Cademycode.

## Project Objectives

- Complete a project to add to portfolio
- Use Jupyter notebooks to explore and clean a dataset
- Use Python to automate data cleaning and transformation using unit tests and error logging
- Use Bash scripts to automate file management and run scripts

## Prerequisites

- Intermediate and Advanced Python 3
- Pandas
- Bash Scripting

## Project Tasks

- Set Up
- Inspect and Clean Data
- Clean the Output CSV
- Develop Unit Test and Logs
- Create a Bash Script
- Create a Readme
- Create a Writeup
- Save your Project

## Set Up

Download the starter kit and set up your working directory to explore the data! When you’re ready, connect to the starter database by loading `dev/cademycode.db` in a Jupyter notebook.

- Download the starter kit
- Unzip the starter kit
- You should get a folder containing a folder `/dev`
- Create a Jupyter notebook in the `/dev` folder for your initial exploration
- Use the sqlite3 Python package or SQLAlchemy to establish a database connection
- Use the database `/cademycode.db` for your development

In [1]:
import sqlite3
import pandas as pd

con = sqlite3.connect('dev/cademycode.db')
print('Connection to database successful.')

Connection to database successful.

## Inspect and Clean the data

Import the tables in `cademycode.db` as dataframes. Inspect the tables for missing or invalid data and perform any data cleaning operations you think are necessary.

Here are some tips to get started (but remember, there are many different routes to take):

- Use a `SELECT` query on `sqlite_master` to determine the names of the tables
- Use `pandas.read_sql_query` to read each table in as a DataFrame
- Get familiar with the data by using the `.head()` function to explore the first handful of rows in the database.
- Look for null values or invalide datatypes by using
- `.info()` to display a summary table of each column
- `.describe()` to calculate summary statistics for all numerical columns
- `.value_counts()` to display each column’s distinct values.

Let's begin by listing all tables from database.

In [2]:
tables = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table';", con)
tables

                      name
0      cademycode_students
1       cademycode_courses
2  cademycode_student_jobs

Now let's import these tables as DataFrames and inspect them.

In [3]:
def inspect_dataframes(dataframes):
    for table_name, df in dataframes.items():
        print(f"\nTable: {table_name}")
        display(df.head())
        print("\nInfo:")
        display(df.info())
        print("\nDescribe:")
        display(df.describe())
        for column in df.columns:
            print(f"\nValue counts for {column}:")
            display(df[column].value_counts())

table_names = tables['name'].tolist()
df = {table: pd.read_sql_query(f"SELECT * FROM {table}", con) for table in table_names}

inspect_dataframes(df)

Table: cademycode_students

,uuid,name,dob,sex,contact_info,job_id,num_course_taken,current_career_path_id,time_spent_hrs
0,1,Annabelle Avery,1943-07-03,F,"{""mailing_address"": ""303 N Timber Key, Irondal...",7.0,6.0,1.0,4.99
1,2,Micah Rubio,1991-02-07,M,"{""mailing_address"": ""767 Crescent Fair, Shoals...",7.0,5.0,8.0,4.4
2,3,Hosea Dale,1989-12-07,M,"{""mailing_address"": ""P.O. Box 41269, St. Bonav...",7.0,8.0,8.0,6.74
3,4,Mariann Kirk,1988-07-31,F,"{""mailing_address"": ""517 SE Wintergreen Isle, ...",6.0,7.0,9.0,12.31
4,5,Lucio Alexander,1963-08-31,M,"{""mailing_address"": ""18 Cinder Cliff, Doyles b...",7.0,14.0,3.0,5.64

Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   uuid                    5000 non-null   int64
 1   name                    5000 non-null   object
 2   dob                     5000 non-null   object
 3   sex                     5000 non-null   object
 4   contact_info            5000 non-null   object
 5   job_id                  4995 non-null   object
 6   num_course_taken        4749 non-null   object
 7   current_career_path_id  4529 non-null   object
 8   time_spent_hrs          4529 non-null   object
dtypes: int64(1), object(8)
memory usage: 351.7+ KB

None

Describe:

              uuid
count  5000.000000
mean   2500.500000
std    1443.520003
min       1.000000
25%    1250.750000
50%    2500.500000
75%    3750.250000
max    5000.000000

Value counts for uuid:

uuid
1       1
3331    1
3338    1
3337    1
3336    1
       ..
1667    1
1666    1
1665    1
1664    1
5000    1
Name: count, Length: 5000, dtype: int64

Value counts for name:

name
Melvin Felt              2
Robbie Davies            2
Annabelle Avery          1
Kelley Munnickhuijsen    1
Rachel de Kruijff        1
                        ..
Cleopatra Singleton      1
Linwood Patrick          1
Marcia Beeldhouwer       1
Arnoldo Rodgers          1
Elton Otway              1
Name: count, Length: 4998, dtype: int64

Value counts for dob:

dob
1993-08-03    4
1955-05-27    4
1953-12-05    3
1995-06-13    3
1956-05-22    3
             ..
1960-09-21    1
1992-05-08    1
1979-03-22    1
1966-12-30    1
1994-12-23    1
Name: count, Length: 4492, dtype: int64

Value counts for sex:

sex
M    1995
F    1990
N    1015
Name: count, dtype: int64

Value counts for contact_info:

contact_info
{"mailing_address": "303 N Timber Key, Irondale, Wisconsin, 84736", "email": "annabelle_avery9376@woohoo.com"}      1
{"mailing_address": "768 Silent Skyway, Impact, Idaho, 90270", "email": "orval_devos4502@coldmail.com"}             1
{"mailing_address": "409 SW First Pike, Leary, North Carolina, 43428", "email": "rachel886@woohoo.com"}             1
{"mailing_address": "554 Broad Rose, Flagler Beach, Florida, 65799", "email": "allan8306@inlook.com"}               1
{"mailing_address": "872 Wagon Land, Guthrie Center, Colorado, 86498", "email": "isidro3025@woohoo.com"}            1
                                                                                                                   ..
{"mailing_address": "470 Essex Curve, Copan, Mississippi, 86309", "email": "cleopatra_singleton7791@inlook.com"}    1
{"mailing_address": "162 Iron Chase, Campbell Station, Oklahoma, 78795", "email": "patrick6416@inlook.com"}         1
{"mailing_address": "889 Mountain Alley, Quioque, Florida, 22930", "email": "marcia9217@coldmail.com"}              1
{"mailing_address": "P.O. Box 69948, Hastings borough, Iowa, 13359", "email": "rodgers8447@hmail.com"}              1
{"mailing_address": "406 Zephyr Port, Oskaloosa, Alabama, 74534", "email": "elton_otway5644@inlook.com"}            1
Name: count, Length: 5000, dtype: int64

Value counts for job_id:

job_id
2.0    706
1.0    693
7.0    680
3.0    675
4.0    671
5.0    660
6.0    657
8.0    253
Name: count, dtype: int64

Value counts for num_course_taken:

num_course_taken
5.0     341
12.0    332
2.0     312
15.0    309
10.0    306
7.0     303
13.0    297
0.0     296
8.0     291
11.0    289
4.0     285
6.0     282
14.0    280
3.0     279
1.0     279
9.0     268
Name: count, dtype: int64

Value counts for current_career_path_id:

current_career_path_id
5.0     476
3.0     469
10.0    460
1.0     459
6.0     454
2.0     450
7.0     449
9.0     441
8.0     437
4.0     434
Name: count, dtype: int64

Value counts for time_spent_hrs:

time_spent_hrs
5.93     8
17.47    8
11.9     7
7.05     7
2.91     7
        ..
27.53    1
8.07     1
27.51    1
29.66    1
23.54    1
Name: count, Length: 2192, dtype: int64

Table: cademycode_courses

   career_path_id      career_path_name  hours_to_complete
0               1        data scientist                 20
1               2         data engineer                 20
2               3          data analyst                 12
3               4  software engineering                 25
4               5      backend engineer                 18

Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   career_path_id     10 non-null     int64
 1   career_path_name   10 non-null     object
 2   hours_to_complete  10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 372.0+ bytes

None

Describe:

       career_path_id  hours_to_complete
count        10.00000          10.000000
mean          5.50000          21.900000
std           3.02765           6.707376
min           1.00000          12.000000
25%           3.25000          18.500000
50%           5.50000          20.000000
75%           7.75000          26.500000
max          10.00000          35.000000

Value counts for career_path_id:

career_path_id
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
Name: count, dtype: int64

Value counts for career_path_name:

career_path_name
data scientist               1
data engineer                1
data analyst                 1
software engineering         1
backend engineer             1
frontend engineer            1
iOS developer                1
android developer            1
machine learning engineer    1
ux/ui designer               1
Name: count, dtype: int64

Value counts for hours_to_complete:

hours_to_complete
20    3
27    2
12    1
25    1
18    1
35    1
15    1
Name: count, dtype: int64

Table: cademycode_student_jobs

   job_id        job_category  avg_salary
0       1           analytics       86000
1       2            engineer      101000
2       3  software developer      110000
3       4            creative       66000
4       5  financial services      135000

Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   job_id        13 non-null     int64
 1   job_category  13 non-null     object
 2   avg_salary    13 non-null     int64
dtypes: int64(2), object(1)
memory usage: 444.0+ bytes

None

Describe:

          job_id     avg_salary
count  13.000000      13.000000
mean    4.384615   89230.769231
std     2.662657   34727.879881
min     0.000000   10000.000000
25%     3.000000   66000.000000
50%     4.000000   86000.000000
75%     6.000000  110000.000000
max     9.000000  135000.000000

Value counts for job_id:

job_id
3    2
4    2
5    2
1    1
2    1
6    1
7    1
8    1
9    1
0    1
Name: count, dtype: int64

Value counts for job_category:

job_category
software developer    2
creative              2
financial services    2
analytics             1
engineer              1
education             1
HR                    1
student               1
healthcare            1
other                 1
Name: count, dtype: int64

Value counts for avg_salary:

avg_salary
110000    2
66000     2
135000    2
80000     2
86000     1
101000    1
61000     1
10000     1
120000    1
Name: count, dtype: int64

Let's take a look at what insights we might get from this data:

### Table: `cademycode_students`
1. **Data Types**:
   - All columns, except `uuid` are `object`type even though they keep different types of data (date, numbers, etc.).

2. **Null Data**:
   - Columns `job_id`, `num_course_taken`, `current_career_path_id` and `time_spent_hrs` have null data.

3. **Doubled data**:
   - Two names (`Melvin Felt` and `Robbie Davies`) have been counted twice.

4. **Gender Distribution**:
   - We have the same proportion of men (`M`) and women (`F`) in the courses, with a significant number of `N` (non specified).

5. **Contact Information**:
   - Column `contact_info` has a `mailing_address` and an `email`.

6. **Job IDs**:
   - Distinct values for `job_id`, probably related to `cademycode_student_jobs` table.

7. **Number of courses taken**:
   - `num_course_taken` indicates the number of courses users took.

8. **Time Spent**:
   - `time_spent_hrs` shows time spent from users in courses.

### Table: `cademycode_courses`
1. **Table Data**:
   - There are 10 courses added, with the necessarty hours to complete each.

2. **Data Integrity**:
   - Values are complete and coherent, as there is no apparent issues.

### Table: `cademycode_student_jobs`
1. **Category and Pay**:
   - Table contains job category and average pay for each profession.

2. **Pay Statistics**:
   - Average pay is 89,230.77, with a standard deviation of 34,727.88, with a minimum of 10,000.00 and a maximum of 135,000.00

3. **Doubled Values**:
   - There are doubled values for `job_id`.

## Next Steps

1. **Data Tidying**:
   - Correct data type in columns for `cademycode_students`.
   - Treat null values for columns `job_id`, `num_course_taken`, `current_career_path_id` and `time_spent_hrs`.
   - Solve doubled data in names and job id.

2. **Data Transformation**:
   - Dividing `contact_info` into separate columns for `mailing_address` and `email`.
   - Join related tables (i.e., joining `job_id` to `cademycode_students` and `cademycode_student_jobs`).

3. **Final Table Creation**:
   - Build one unique final table, with joined data tidy data.

Let's begin by converting columns `dob`, `job_id`, `num_course_taken`, `current_career_path_id` e `time_spent_hrs` to appropriate data types.

In [4]:
students_df = df['cademycode_students'].copy()

students_df['dob'] = pd.to_datetime(students_df['dob'], errors='coerce')
students_df['job_id'] = pd.to_numeric(students_df['job_id'], errors='coerce')
students_df['num_course_taken'] = pd.to_numeric(students_df['num_course_taken'], errors='coerce')
students_df['current_career_path_id'] = pd.to_numeric(students_df['current_career_path_id'], errors='coerce')
students_df['time_spent_hrs'] = pd.to_numeric(students_df['time_spent_hrs'], errors='coerce')

print('Data Types after Convertion:')
students_df.dtypes

Data Types after Convertion:

uuid                               int64
name                              object
dob                       datetime64[ns]
sex                               object
contact_info                      object
job_id                           float64
num_course_taken                 float64
current_career_path_id           float64
time_spent_hrs                   float64
dtype: object

Now we can treat null values for columns `job_id`, `num_course_taken`, `current_career_path_id` e `time_spent_hrs`.

To deal with null values, we can:

- Fill nulls with standard values (i.e. 0);
- Fill nulls with median values for column;
- Remove rows with null values (if applicable).

In this case, we will fill `job_id` e `current_career_path_id` with `0` (indicating 'unemployed' and 'not enrolled') and then use median for `num_course_taken` e `time_spent_hrs`.

In [5]:
students_df.loc[:, 'job_id'] = students_df['job_id'].fillna(0)
students_df.loc[:, 'current_career_path_id'] = students_df['current_career_path_id'].fillna(0)

students_df.loc[:, 'num_course_taken'] = students_df['num_course_taken'].fillna(students_df['num_course_taken'].median())
students_df.loc[:, 'time_spent_hrs'] = students_df['time_spent_hrs'].fillna(students_df['time_spent_hrs'].median())

print("Null values after filling:")
students_df.isnull().sum()

Null values after filling:

uuid                      0
name                      0
dob                       0
sex                       0
contact_info              0
job_id                    0
num_course_taken          0
current_career_path_id    0
time_spent_hrs            0
dtype: int64

Now let's identify and treat duplication data in `cademycode_students`. First, let's show all rows with the same `name`:

In [6]:
duplicate_names = ['Melvin Felt', 'Robbie Davies']
duplicate_rows = students_df[students_df['name'].isin(duplicate_names)]

print('Rows with duplicate names:')
display(duplicate_rows)

Rows with duplicate names:

,uuid,name,dob,sex,contact_info,job_id,num_course_taken,current_career_path_id,time_spent_hrs
534,535,Robbie Davies,1965-06-11,F,"{""mailing_address"": ""666 Dusty Land, Pangburn,...",5.0,15.0,3.0,0.53
1118,1119,Melvin Felt,1955-07-30,N,"{""mailing_address"": ""804 Rustic Elm, Geneseo v...",3.0,6.0,10.0,2.77
2116,2117,Robbie Davies,1942-10-17,M,"{""mailing_address"": ""111 Squaw Alley, Buckeye,...",7.0,0.0,0.0,10.67
3583,3584,Melvin Felt,1987-08-25,N,"{""mailing_address"": ""54 Noble Loaf Run, Lakela...",3.0,11.0,1.0,0.47

This table shows that the names are not duplicated, instead they are from homonymous people. To be sure, let's count duplicated data in the dataframe:

In [7]:
duplicates = students_df.duplicated(subset=['name', 'dob', 'sex', 'contact_info'])
print(f"Number of duplicates found: {duplicates.sum()}")

# Mostrar duplicações
print("Duplicates found:")
display(students_df[duplicates])

Number of duplicates found: 0
Duplicates found:

Empty DataFrame
Columns: [uuid, name, dob, sex, contact_info, job_id, num_course_taken, current_career_path_id, time_spent_hrs]
Index: []

As in fact there is no duplicated rows, there is no need to remove these entries. So let's go ahead and divide `column_info` into `mailing_address` and `email`:

In [8]:
import json

def extract_contact_info(contact_info):
    try:
        # Here we extracted data as a json object because the data in contact_info is in a json format.
        info = json.loads(contact_info.replace("'", '"'))
        return pd.Series([info.get('mailing_address'), info.get('email')])
    except json.JSONDecoderError:
        return pd.Series([None, None])

students_df[['mailing_address', 'email']] = students_df['contact_info'].apply(extract_contact_info)
students_df.drop(columns=['contact_info'], inplace=True)

print('Data after contact_info split:')
display(students_df.head())

Data after contact_info split:

,uuid,name,dob,sex,job_id,num_course_taken,current_career_path_id,time_spent_hrs,mailing_address,email
0,1,Annabelle Avery,1943-07-03,F,7.0,6.0,1.0,4.99,"303 N Timber Key, Irondale, Wisconsin, 84736",annabelle_avery9376@woohoo.com
1,2,Micah Rubio,1991-02-07,M,7.0,5.0,8.0,4.40,"767 Crescent Fair, Shoals, Indiana, 37439",rubio6772@hmail.com
2,3,Hosea Dale,1989-12-07,M,7.0,8.0,8.0,6.74,"P.O. Box 41269, St. Bonaventure, Virginia, 83637",hosea_dale8084@coldmail.com
3,4,Mariann Kirk,1988-07-31,F,6.0,7.0,9.0,12.31,"517 SE Wintergreen Isle, Lane, Arkansas, 82242",kirk4005@hmail.com
4,5,Lucio Alexander,1963-08-31,M,7.0,14.0,3.0,5.64,"18 Cinder Cliff, Doyles borough, Rhode Island,...",alexander9810@hmail.com

Now let's check for duplicate data in the other tables.

In [9]:
courses_df = df['cademycode_courses'].copy()
course_duplicates = courses_df.duplicated()

print(f"Duplications find in cademycode_courses: {course_duplicates.sum()}")

if course_duplicates.sum() > 0 : display(courses_df[course_duplicates])
else : print('No duplication found on cademycode_courses.')

print('----------')

jobs_df = df['cademycode_student_jobs'].copy()
jobs_duplicates = jobs_df.duplicated()

print(f"Duplications find in cademycode_student_jobs: {jobs_duplicates.sum()}")

if jobs_duplicates.sum() > 0 : display(jobs_df[jobs_duplicates])
else : print('No duplication found on cademycode_student_jobs.')

Duplications find in cademycode_courses: 0
No duplication found on cademycode_courses.
----------
Duplications find in cademycode_student_jobs: 3

    job_id        job_category  avg_salary
10       3  software developer      110000
11       4            creative       66000
12       5  financial services      135000

We understand that duplicates in the `cademycode_student_jobs` table represent different roles within the same category, so we can keep those records.

Now we can join `students_df`, `jobs_df` and `courses_df` tables to create a final consolidated table.

In [10]:
merged_df = pd.merge(students_df, jobs_df, how='left', left_on='job_id', right_on='job_id')
final_df = pd.merge(merged_df, courses_df, how='left', left_on='current_career_path_id', right_on='career_path_id')

display(final_df.head())

,uuid,name,dob,sex,job_id,num_course_taken,current_career_path_id,time_spent_hrs,mailing_address,email,job_category,avg_salary,career_path_id,career_path_name,hours_to_complete
0,1,Annabelle Avery,1943-07-03,F,7.0,6.0,1.0,4.99,"303 N Timber Key, Irondale, Wisconsin, 84736",annabelle_avery9376@woohoo.com,HR,80000,1.0,data scientist,20.0
1,2,Micah Rubio,1991-02-07,M,7.0,5.0,8.0,4.40,"767 Crescent Fair, Shoals, Indiana, 37439",rubio6772@hmail.com,HR,80000,8.0,android developer,27.0
2,3,Hosea Dale,1989-12-07,M,7.0,8.0,8.0,6.74,"P.O. Box 41269, St. Bonaventure, Virginia, 83637",hosea_dale8084@coldmail.com,HR,80000,8.0,android developer,27.0
3,4,Mariann Kirk,1988-07-31,F,6.0,7.0,9.0,12.31,"517 SE Wintergreen Isle, Lane, Arkansas, 82242",kirk4005@hmail.com,education,61000,9.0,machine learning engineer,35.0
4,5,Lucio Alexander,1963-08-31,M,7.0,14.0,3.0,5.64,"18 Cinder Cliff, Doyles borough, Rhode Island,...",alexander9810@hmail.com,HR,80000,3.0,data analyst,12.0

Here's a summary:

1. Merge `students_df` with `jobs_df`:

- We use `job_id` as the key to join the two tables.
- `how='left'` ensures that all entries from `students_df` are kept, even if there are no matches in `jobs_df`.

2. Merge `merged_df` with `courses_df`:

- We use `current_career_path_id` as the key to join the two tables.
- `how='left'` ensures that all entries from `merged_df` are kept, even if there are no matches in `courses_df`.

The final table looks well consolidated and clean, with all the necessary columns and no obvious duplications or null values ​​remaining. Now we can move on to the next task.